# Тест-кейсы OWASP Juice Shop

**ID:** TC-001

**Summary:** Авторизация с валидными данными

**Preconditions:**

- Пользователь зарегистрирован.
- Пользователь не авторизован.
- Открыта страница авторизации.

**Test Data:**

- Email: `test@mail.com`
- Password: `12345`

**Steps:**

1. Ввести зарегистрированный email в поле Email.
2. Ввести корректный пароль в поле Password.
3. Нажать кнопку "Log in".

**Expected Result:**

Пользователь успешно авторизован. Открывается главная страница приложения, в меню отображается учётная запись пользователя.
